src/DataProcessors/КонтрольОшибокВыпискиРТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтрольОшибокВыпискиРТУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменовПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменовПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокОшибок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КритическиеСобытияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КритическиеСобытияСистемы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьОповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВозникновения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникКритическогоСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникКритическогоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/КонтрольОшибокВыпискиРТУ/Ext/ManagerModule.bsl
Процедура КонтрольВыгрузкиРТУВТоплог(Период,Событие)   Экспорт
	//Период - число дней от текущей даты	
	Если НЕ  Типзнч(Период) = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Не корректно заполнен период");
	КонецЕсли;	
	
	ВыборкаДанных  = ПолучитьОшибкиВыгрузкиРТУ(Период,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
	КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(ВыборкаДанных.Документ,Событие,ВыборкаДанных.ОписаниеОшибки +"("+ВыборкаДанных.ТипДоставки+")");		
	КонецЦикла;	
	
КонецПроцедуры	


Функция ПолучитьОшибкиВыгрузкиРТУ(Период,Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ,
		|	ВЫБОР
		|		КОГДА ИсторияОбменовПоОбъектам.Ошибка
		|			ТОГДА ""При выгрузке произошли Ошибки"" + ИсторияОбменовПоОбъектам.ТекстОшибки
		|		ИНАЧЕ ""Документ не выгружен""
		|	КОНЕЦ КАК ОписаниеОшибки,
		|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.ТипДоставки) КАК ТипДоставки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОбменовПоОбъектам КАК ИсторияОбменовПоОбъектам
		|		ПО РеализацияТоваровУслуг.Ссылка = ИсторияОбменовПоОбъектам.Объект
		|			И (ИсторияОбменовПоОбъектам.Узел = &УзелТоплог)
		|			И (ИсторияОбменовПоОбъектам.Исходящее = ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КритическиеСобытияСистемы КАК КритическиеСобытияСистемы
		|		ПО РеализацияТоваровУслуг.Ссылка = КритическиеСобытияСистемы.ИсточникКритическогоСобытия
		|			И (КритическиеСобытияСистемы.Событие = &Событие)
		|ГДЕ
		|	(ИсторияОбменовПоОбъектам.Объект ЕСТЬ NULL
		|			ИЛИ ИсторияОбменовПоОбъектам.Ошибка)
		|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|	И РеализацияТоваровУслуг.ЭтоМФП = ЛОЖЬ
		|	И РеализацияТоваровУслуг.флНеВыгружатьВТопЛог = ЛОЖЬ
		|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И НЕ РеализацияТоваровУслуг.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.РеализацияТоваровУслугНовый)
		|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
		|	И РеализацияТоваровУслуг.Склад.ОбменСTopLog = ИСТИНА
		|	И КритическиеСобытияСистемы.ИсточникКритическогоСобытия ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата() - 600);  //10 минут временой лаг на выгрузку в топлог
	Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДата() - Период * 24*60*60);
	Запрос.УстановитьПараметр("УзелТоплог",    ОбменССайтомСервер.УзелПланаОбмена("ОбменПартКом83_TopLog_РТУ",Ложь));
	Запрос.УстановитьПараметр("Событие", Событие);

	РезультатЗапроса = Запрос.Выполнить();
	
	
 Возврат РезультатЗапроса.Выбрать();
		
КонецФункции	

Процедура КонтрольСтатусовРТУ(Период,Событие) Экспорт
	 Если Типзнч(Период) = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		  Период = НачалоГода(ТекущаяДата());
	 КонецЕсли;	
	
	ВыборкаДанных  = ПолучитьОшибкиСтатусовРТУ(Период,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
	СообщениеОшибки = "Не обработан статус у РТУ "+ СокрЛП(ВыборкаДанных.Документ) +"("+ВыборкаДанных.Контрагент +")" + ", тек.стататус: " + ВыборкаДанных.СтатусДокумента;  
	КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(ВыборкаДанных.Документ,Событие,СообщениеОшибки);		
	КонецЦикла;	
	

КонецПроцедуры	

Функция ПолучитьОшибкиСтатусовРТУ(Период,Событие)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ,
		|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.СтатусДокумента) КАК СтатусДокумента,
		|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Контрагент) КАК Контрагент
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиСайта КАК УчетныеЗаписиСайта
		|		ПО РеализацияТоваровУслуг.ТорговаяТочка = УчетныеЗаписиСайта.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КритическиеСобытияСистемы КАК КритическиеСобытияСистемы
		|		ПО РеализацияТоваровУслуг.Ссылка = КритическиеСобытияСистемы.ИсточникКритическогоСобытия
		|			И (КритическиеСобытияСистемы.Событие = &Событие)
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен = ИСТИНА
		|	И НЕ РеализацияТоваровУслуг.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.РеализацияТоваровУслугОтгружен)
		|	И РеализацияТоваровУслуг.ЭтоМФП = ЛОЖЬ
		|	И РеализацияТоваровУслуг.Дата > &Период
		|	И ВЫБОР
		|			КОГДА УчетныеЗаписиСайта.Ссылка ЕСТЬ NULL
		|				ТОГДА РеализацияТоваровУслуг.Дата <= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ТекущаяДата КАК ДАТА), ДЕНЬ), ДЕНЬ, -7)
		|			ИНАЧЕ РеализацияТоваровУслуг.Дата <= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ТекущаяДата КАК ДАТА), ДЕНЬ), ДЕНЬ, -1)
		|		КОНЕЦ
		|	И РеализацияТоваровУслуг.флНеВыгружатьВТопЛог = ЛОЖЬ
		|	И КритическиеСобытияСистемы.ИсточникКритическогоСобытия ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Событие", Событие);

	РезультатЗапроса = Запрос.Выполнить();
	
 Возврат РезультатЗапроса.Выбрать();
		

	
КонецФункции
